EpKouhia/strome-ir-matter/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

# ESP32-C6 uses Matter-over-Thread for this IR controller.
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n
CONFIG_ENABLE_MATTER_OVER_THREAD=y
CONFIG_THREAD_NETWORK_COMMISSIONING_DRIVER=y
CONFIG_THREAD_NETWORK_ENDPOINT_ID=0

# Keep the data model consistent: no Wi-Fi Network Commissioning on this image.
CONFIG_ENABLE_WIFI_STATION=n
CONFIG_WIFI_NETWORK_COMMISSIONING_DRIVER=n

# Thread needs full mDNS and more IPv6 address slots.
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y
CONFIG_LWIP_IPV6_AUTOCONFIG=n
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y

# This controller is mains-powered, not an ICD/sleepy device.
CONFIG_ENABLE_ICD_SERVER=n
CONFIG_SUPPORT_ICD_MANAGEMENT_CLUSTER=n
